ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЖБИ_ПодтверждениеПлановыхСтавок/ЖБИ_ПодтверждениеПлановыхСтавок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЖБИ_ПодтверждениеПлановыхСтавок</name>
  <comment>ЖБИ - Подтверждение плановых ставок</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <comment>Поставщик</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерЛогист</name>
    <comment>Менеджер логист</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <comment>Бизнес-регион</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтгрузки</name>
    <comment>Тип отгрузки</comment>
    <type>
      <types>EnumRef.ЖБИ_ТипыОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <comment>Статус</comment>
    <type>
      <types>EnumRef.ЖБИ_СтатусРасчетаСтавки</types>
    </type>
  </attributes>
  <attributes>
    <name>Негабаритный</name>
    <comment>Не габарит</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УкрупненнаяСтавка</name>
    <comment>Ставка, руб</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТранспорта</name>
    <comment>Машин согласовано</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаАвто</name>
    <comment>Машин, базовое кол-во</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопРасходы</name>
    <comment>Доп. расходы</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопЗатратыНаХвост</name>
    <comment>Доп. затр. на хвост</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопЗатратыНаМатериалы</name>
    <comment>Доп. затр. на материалы</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗатратНаПеревозку</name>
    <comment>Все затраты на транспортировку</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <comment>Согласовано</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечаниеСогласования</name>
    <comment>Примечание согласования</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Товары</comment>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <comment>Номенклатура поставщика</comment>
      <type>
        <types>CatalogRef.НоменклатураПоставщиков</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЖБИ_УТ11.РасширениеЖБИ/src/Enums/ЖБИ_СтатусЗаявкиПокупателя/ЖБИ_СтатусЗаявкиПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЖБИ_СтатусЗаявкиПокупателя</name>
  <comment>ЖБИ - Статус заявки покупателя</comment>
  <enumValues>
    <name>Новый</name>
    <comment>Новый</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленНаРасчетПлановыхСтавок</name>
    <comment>Отправлен на расчет плановых ставок</comment>
  </enumValues>
  <enumValues>
    <name>РасчетПлановыхСтавок</name>
    <comment>Расчет плановых ставок</comment>
  </enumValues>
  <enumValues>
    <name>ОкончательныйРасчет</name>
    <comment>Окончательный расчет</comment>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеЛогистами</name>
    <comment>Подтверждение логистами</comment>
  </enumValues>
  <enumValues>
    <name>ПодготовкаСчета</name>
    <comment>Подготовка счета</comment>
  </enumValues>
  <enumValues>
    <name>ВыпискаДокументов</name>
    <comment>Выписка документов</comment>
  </enumValues>
  <enumValues>
    <name>ВОтгрузке</name>
    <comment>В отгрузке</comment>
  </enumValues>
  <enumValues>
    <name>ИстекСрокДействия</name>
    <comment>Истек срок действия</comment>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
    <comment>Отгружено</comment>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
    <comment>Завершен</comment>
  </enumValues>
  <enumValues>
    <name>ВАрхиве</name>
    <comment>В архиве</comment>
  </enumValues>
  <enumValues>
    <name>Удален</name>
    <comment>Удален</comment>
  </enumValues>
</mdclass:Enum>

ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЖБИ_ПодтверждениеПлановыхСтавок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

Функция ИзменитьСтатусЗаявкиПодтверждениеЛогистами(ЗаявкаСсылка,СсылкаПодтверждение,Согласование,СообщениеОбОшибке) Экспорт
	
	Отказ = Ложь;
	
	ОбъекЗаявка = ЗаявкаСсылка.ПолучитьОбъект();
	
	////заполнение ставки	
	//Для Каждого НомСтр Из СсылкаПодтверждение.Товары Цикл
	//	СтруктураПараметров = Новый Структура("Пометка,Номенклатура,УкрупненнаяСтавка",Истина,НомСтр.Номенклатура,СсылкаПодтверждение.СуммаЗатратНаПеревозку);
	//	Документы.ЖБИ_ЗаявкиПокупателей.РасчитатьСтавкиТЧЗаявки(ОбъекЗаявка.ПредварительныйРасчет,СтруктураПараметров);
	//КонецЦикла;

	////заполнение ставки с учетом доп. затрат
	//ОбщиеДопРасходы = СсылкаПодтверждение.ДопЗатратыНаХвост + СсылкаПодтверждение.ДопЗатратыНаМатериалы;
	//Для Каждого НомСтр Из СсылкаПодтверждение.Товары Цикл
	//	СтруктураПараметров = Новый Структура("Номенклатура,Поставщик,ДопРасходыНаРейс",НомСтр.Номенклатура,СсылкаПодтверждение.Партнер,ОбщиеДопРасходы);
	//	Документы.ЖБИ_ЗаявкиПокупателей.РасчитатьСтавкиДопРасходыНаРейс(ОбъекЗаявка.ПредварительныйРасчет,СтруктураПараметров);
	//КонецЦикла;
	
	////расчет стоимости
	//ЖБИ_ОбщийМодульДокументы.РасчитатьСтоимость(ЗаявкаСсылка,ОбъекЗаявка.ОкончательныйРасчет,ОбъекЗаявка.КонтрольТранспорта);
	
	Согласовано = Согласование;
	СтруктураПоиска = Новый Структура("Поставщик",СсылкаПодтверждение.Партнер);
	НайденнаяСтрока = ОбъекЗаявка.КонтрольТранспорта.НайтиСтроки(СтруктураПоиска);
	Для Каждого НомСтр Из НайденнаяСтрока Цикл
		НомСтр.СогласованоОЛиЗ = НЕ Согласовано;	
	КонецЦикла;	
	
	СтатусЗавершен = Документы.ЖБИ_ЗаявкиПокупателей.МожноПереводитьДокументНаОкончательныйРасчет(ЗаявкаСсылка, СсылкаПодтверждение);
	Если СтатусЗавершен 
		И ЗаявкаСсылка.Статус = Перечисления.ЖБИ_СтатусЗаявкиПокупателя.ПодтверждениеЛогистами Тогда 
		ОбъекЗаявка.Статус = Перечисления.ЖБИ_СтатусЗаявкиПокупателя.ОкончательныйРасчет;
		//расчет стоимости
		ЖБИ_ОбщийМодульДокументы.РасчитатьСтоимость(ЗаявкаСсылка,ОбъекЗаявка.ОкончательныйРасчет.Выгрузить(),ОбъекЗаявка.КонтрольТранспорта.Выгрузить());
	КонецЕсли;

	Попытка
		ОбъекЗаявка.Записать();
	Исключение
		СообщениеОбОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Отказ = Истина;
		Возврат Отказ;
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции

#КонецОбласти

#КонецЕсли
